Autodesk.Revit.DB.FDXImportOptions.SetLogOutputDirectory(System.String)
Sets the directory path where log files will be written during FDX import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FDXImportOptions.CreateLevels
Controls whether to create Levels from FDX or not.
Since:
2024

Autodesk.Revit.DB.FDXImportOptions.ExchangeId
The FDX exchange identifier.
Since:
2024

Autodesk.Revit.DB.FDXImportOptions.#ctor
Creates a new default set of options for ATF based import.
Since:
2024

Autodesk.Revit.DB.FDXImportOptions
The import options used to import FDX data exchanges via ATF.
Since:
2024